week11/action_text_video_blog/app/controllers/posts_controller.rb

UPDATE "posts" SET "views" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["views", 1], ["updated_at", "2020-07-21 03:44:36.792087"], ["id", 1]]
---
  def show
    # @post.views += 1
    @post.views = @post.views + 1
    @post.save

INSERT INTO "posts" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "This is a test post!"], ["created_at", "2020-07-21 03:47:41.242623"], ["updated_at", "2020-07-21 03:47:41.242623"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "updated_at" = ? WHERE "posts"."id" = ?  [["updated_at", "2020-07-21 03:48:38.180028"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)