week14/demo/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post = assign_post_creator(@post, current_user)
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["body", "ase"], ["user_id", 1], ["created_at", "2020-12-06 20:45:30.774306"], ["updated_at", "2020-12-06 20:45:30.774306"]]

  def set_post
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]