week15/demo/backend/app/controllers/api/v1/todos_controller.rb

  def index
    @todos = Todo.all
    limit = params[:_limit]
    if limit.present?
      limit = limit.to_i
      @todos = @todos.last(limit)
---
SELECT "todos".* FROM "todos"
SELECT "todos".* FROM "todos" ORDER BY "todos"."id" DESC LIMIT ?  [["LIMIT", 5]]

  def create
    @todo = Todo.new(todo_params)

    if @todo.save
---
INSERT INTO "todos" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "4"], ["created_at", "2020-12-06 06:53:04.448524"], ["updated_at", "2020-12-06 06:53:04.448524"]]

  def update
    if @todo.update(todo_params)
---
UPDATE "todos" SET "completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["completed", 1], ["updated_at", "2020-12-06 06:53:33.121649"], ["id", 18]]