week19/demo/backend/app/controllers/api/v1/todos_controller.rb

SELECT "todos".* FROM "todos"
SELECT "todos".* FROM "todos" ORDER BY "todos"."id" DESC LIMIT ?  [["LIMIT", 5]]
---
  def index
    @todos = Todo.all
    limit = params[:_limit]

    if limit.present?
      limit = limit.to_i
      @todos = @todos.last(limit)

INSERT INTO "todos" ("title", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hello again, world."], ["completed", 0], ["created_at", "2020-12-11 06:22:40.186120"], ["updated_at", "2020-12-11 06:22:40.186120"]]
---
  def create
    @todo = Todo.new(todo_params)

    if @todo.save

UPDATE "todos" SET "completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["completed", 1], ["updated_at", "2020-12-11 06:08:33.501578"], ["id", 1]]
---
  def update
    if @todo.update(todo_params)