week14/tested_app/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post = assign_post_creator(@post, current_user)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "This is a test post!"], ["body", "Hello world"], ["user_id", 1], ["created_at", "2020-12-08 04:39:26.017908"], ["updated_at", "2020-12-08 04:39:26.017908"]]