week18/hotwire-todo/app/controllers/completed_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "todos" SET "completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["completed", 1], ["updated_at", "2020-12-30 09:59:11.857150"], ["id", 2]]
---
  def update
    @todo = Todo.find(params[:id])
    @todo.completed = !@todo.completed
    @todo.save