week18/hotwire-todo/app/controllers/todos_controller.rb

INSERT INTO "todos" ("title", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "testcase"], ["completed", 1], ["created_at", "2020-12-30 10:15:58.805853"], ["updated_at", "2020-12-30 10:15:58.805853"]]
---
  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save

UPDATE "todos" SET "completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["completed", 0], ["updated_at", "2020-12-30 10:21:57.885773"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @todo.update(todo_params)