week16/production-api/app/controllers/api/v1/todones_controller.rb

  def index
    @todones = Todone.all
---
SELECT "todones".* FROM "todones"