week16/production-api/app/controllers/api/v1/todos_controller.rb

  def index
    @todos = Todo.all
    limit = params[:_limit]

    if limit.present?
      limit = limit.to_i
      @todos = @todos.last(limit)
---
SELECT "todos".* FROM "todos"
SELECT "todos".* FROM "todos" ORDER BY "todos"."id" DESC LIMIT ?  [["LIMIT", 5]]

  def create
    @todo = Todo.new(todo_params)

    if @todo.save
---
INSERT INTO "todos" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "test"], ["created_at", "2020-12-21 11:53:45.646341"], ["updated_at", "2020-12-21 11:53:45.646341"]]