week18/demo/app/controllers/completed_controller.rb

  def update
    @todo = Todo.find(params[:id])
    @todo.completed = !@todo.completed

    respond_to do |format|
      if @todo.save
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
UPDATE "todos" SET "completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["completed", 1], ["updated_at", "2020-12-28 07:08:21.943581"], ["id", 25]]