week18/demo/app/controllers/todos_controller.rb

  def index
    @todos = Todo.all.reverse
---
SELECT "todos".* FROM "todos"

  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save
---
INSERT INTO "todos" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "test"], ["created_at", "2020-12-28 06:58:32.406828"], ["updated_at", "2020-12-28 06:58:32.406828"]]

  def update
    respond_to do |format|
      if @todo.update(todo_params)
---
UPDATE "todos" SET "title" = ?, "completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Hello, World!"], ["completed", 1], ["updated_at", "2020-12-29 08:40:27.642577"], ["id", 24]]